#!/bin/bash
#------------------------------------------------------------------------------
# В этой секции эксперименты с перенаправлением ввода-вывода
#  конвейер команд Linux
#-----
set -e
echo '-- 1'a
ls -la
echo '-- 2'
ls -la | xargs echo
echo '-- 3.1'
ls -la ./ | xargs -I {} echo "{}"
echo '-- 3.2'
ls -la ./ | xargs -I {} echo "Файл: {}"
echo '-- 3.3'
ls -la 'invalid-dir' | xargs -I {} echo "Файл: {}"

echo '-- 4'
ls -la | echo "aaa: $0 $? $*"


#------------------------------------------------------------------------------