#!/bin/bash

#------------------------------------------------------------------------------
# Вариант 1
# Если скрипт запустили через bash
# $ bash ./notes/linux/bash/runInCurrentDir.sh
#----

echo 'workDir(10)='`pwd` # вывод текущего пути
cd $(dirname $(readlink -e $0)) #переход в директорию текущего скрипта

echo 'workDir(20)='`pwd` # вывод текущего пути
# sudo ./myApplication.elf # запуск приложения "myApplication.elf" из текущего каталога в режиме администратора

#------------------------------------------------------------------------------
#  Вариант 2
# Если скрипт запустили через include.  "Вариант 1" тут не работает.
#
# "someScript.sh"
# <code class="bash">
# . ./notes/linux/bash/runInCurrentDir.sh
# </code>
#----

echo 'workDir(30)='`pwd`
cd ./tmp
cd $(dirname "${BASH_SOURCE[0]}")
echo 'workDir(40)='`pwd`

#------------------------------------------------------------------------------


exit 0 #Выход с кодом 0 (удачное завершение работы скрипта)
