#!/bin/bash
#------------------------------------------------------------------------------
cd $(dirname $(readlink -e $0)) #переход в директорию текущего скрипта + на уровень вверх
#------------------------------------------------------------------------------
# Скрипт для быстрого запуска web-встроенного в PHP.
# Текущая папка ляжет в "/usr/src/myapp".
# Порт 80 внутри контейнера, будет проброшен на 11001 снаружи.
#-----

# Запуск браузера
# chromium-browser http://localhost:11001

# Запуск сервера
docker run -it --rm \
    --name tmp-name-of-my-container \
    --publish 11001:80 \
    -v "$PWD":/usr/src/myapp \
    -w /usr/src/myapp \
    php:7.4-cli php -S 0.0.0.0:80 -t .
#-----------------------------------------------------
