#!/bin/bash
#-----------------------------------------------------------------------

echo -e "\n$(printf '\x2D%.0s' {1..80})"
echo "* \$0 (script): <$0>"

#-----------------------------------------------------------------------
# Ищем Файлы в каталоге по маске

function demo() {
  echo '-- demo'
  inpDir=$1
  findMask=$2
  #    inpDir='..'
  #    findMask='*.{txt,md,py}'

  echo "-- inpDir  : '${inpDir}'"
  echo "-- findMask: '${findMask}'"

  # Разбиваем маску на отдельные расширения
  IFS=',' read -ra extensions <<< "$findMask"

  for ext in "${extensions[@]}"; do
    # Убираем фигурные скобки и звездочку из расширения
    echo "ext (0): '${ext}'"

    # Убираем открывающую скобку
    ext="${ext#*{}" # Убираем открывающую фигурную скобку и все до нее
    echo "ext (1): '${ext}'"

    # Убираем закрывающую фигурную скобку
    # ext="${ext%\}}"   # убираем только закрывающую скобку
    ext="${ext%\}*}"  # Убираем закрывающую фигурную скобку и все после нее
    echo "ext (2): '${ext}'"

    # Цикл по всем файлам в директории
    for file in "$inpDir"/*.$ext; do
      echo "file(1): '${file}'"
      if [[ -f "$file" ]]; then
        echo "$file"
      fi
    done
  done
}

demo '..' '*.{py,txt,md,sh}'
demo '.' '*.{py,txt,md,sh}'

#-----------------------------------------------------------------------
echo -e "\n$(printf '\x2D%.0s' {1..80})"
#-----------------------------------------------------------------------
exit 0
